Repository: JonasHiltl/digital-identity-app
Catalog: lib/l10n/intl_*.arb
Languages: de

source: First Name
de: Vorname

source: Last Name
de: Nachname

source: Phone Number
de: Telefonnummer

source: Date of Birth
de: Geburtsdatum

# sex
source: Biological Sex
de: Biologisches Geschlecht

# simpleSex
source: Sex
de: Geschlecht

source: Male
de: Männlich

source: Female
de: Weiblich

# residence
source: Residential Address
de: Wohnadresse

source: Address
de: Adresse

# streetNumber
source: Address
de: Straße + Nr.

source: Postal Code
de: Postleitzahl

source: Country
de: Land

source: City
de: Stadt

source: State
de: Bundesland

source: Allergies
de: Allergien

source: Allergy
de: Allergie

source: Medication
de: Medikament

source: Symptoms
de: Symptome

source: Condition
de: Beschwerde

source: Conditions
de: Beschwerden

source: Frequency
de: Häufigkeit

source: Dose
de: Dosis

source: Issued
de: Erstellt am

source: Cancel
de: Abbrechen

# sharer
source: Shared by
de: Freigeber

source: Personal Data
de: Persönliche Daten

# pluralMedication
source: Medication
de: Medikamente

# personalInfoVC
source: Personal Information Credential
de: Persönliche Informationen Credential

# accessVC
source: Access right
de: Zugriffsrecht

source: Expires at:
de: Abgelaufen am:

source: Unrestricted Access
de: Unbeschränkter Zugriff

source: Patient Questionnaire
de: Patientenfragebogen

source: Patient Questionnaires
de: Patientenfragebogen

# receivedPatientQuestionnaire
source: Received Patient Questionnaires
de: Empfangene Patientenfragebogen

source: Add Allergy
de: Allergie hinzufügen

source: Add Medication
de: Medikament hinzufügen

# examplePollen
source: e.g. Pollen
de: Bsp. Pollen

# exampleSneezing
source: e.g. Sneezing
de: Bsp. Niesen

# exampleAspirin
source: e.g. Aspirin
de: Bsp. Aspirin

# exampleHeadaches
source: e.g. Headaches
de: Bsp. Kopfschmerzen

# exampleOnceDaily
source: e.g. once daily
de: Bsp. einmal täglich

# example75mg
source: e.g. 75 mg
de: Bsp. 75 mg

# editProfile
source: You can only edit this data in settings
de: Informationen nur in den Einstellungen bearbeitbar

# anyAllergies
source: Do you have any allergies?
de: Hast du irgendwelche Allergien?

# anyMedication
source: Do you take any medication?
de: Nimmst du irgendwelche Medikamente?

# createPQ
source: Create Patient Questionnaire
de: Patientenfragebogen erstellen

# givePQName
source: Give your patient Questionnaire a name!
de: Gib deinem Patientenfragebogen einen Namen!

# createHeader
source: Digital Identity
de: Digitale Identität

# createSubheader1
source: Complete the following steps and take control over your digital identity.
de: Vervollständige die folgenden Schritte und übernimm die Kontrolle deiner digitale Identität.

# createHeader2
source: Some personal details
de: Ein paar persönliche Details

# createSubheader2
source: These information are securely stored on your device, you decide when and with whom you want to share it.
de: Diese Informationen werden sicher auf deinem Gerät gespeichert, du entscheidest wann du sie teilen möchtest.

# createHeader3
source: Residential Address
de: Wohnadresse

# createSubheader3
source: Enter your residential address
de: Gib deine Wohnadresse an, um sie sicher zu teilen, wann immer du willst.

# createSuccessMessage
source: Digital Identity successfully created
de: Digitale Identität erfolgreich erstellt

# createErrorMessage
source: Your digital identity creation failed
de: Erstellung deiner digitalen Identität fehlgeschlagen

# createPQSuccessMessage
source: Patient Questionnaire successfully created
de: Patientenfragebogen erfolgreich erstellt

# createPQErrorMessage
source: Your Patient Questionnaire creation failed
de: Erstellung deines Patientenfragebogen fehlgeschlagen

# shareDocErrorMessage
source: Document sharing failed
de: Dokumentenaustausch fehlgeschlagen

# shareDocSuccessMessage
source: Document is now retrievable
de: Dokument ist jetzt abrufbar

# receiveDocSuccessMessage
source: Document successfully received
de: Dokument erfolgreich empfangen

# receiveDocErrorMessage
source: Failed to receive the document
de: Das Dokument konnte nicht empfangen werden

# shareDocExpiryDate
source: Do you want to set an expiration date to your shared document?
de: Möchtest du ein Ablaufdatum für dein geteiltes Dokument festlegen?

# noExpiry
source: No restriction
de: Keine Beschränkung

source: Expiration Date
de: Ablaufdatum

source: Expiration Time
de: Ablaufzeit

# receivingTitle
source: Receiving ...
de: Empfangen ...

# receivingText
source: Verifying Authenticity. The Document will be ready in just a moment!
de: Überprüfung der Authentizität. Das Dokument ist in wenigen Augenblicken verfügbar!

source: No Countries found
de: Keine Länder gefunden

source: No allergies added yet
de: Noch keine Allergie hinzugefügt

source: No allergies added
de: Keine Allergie hinzugefügt

source: No medication added yet
de: Noch kein Medikament hinzugefügt

source: No medication added
de: Kein Medikament hinzugefügt

# noDocReceived
source: You have not received a document yet!
de: Du hast noch kein Dokument erhalten!

# noOwnDocs
source: You have not created your own documents yet!
de: Du hast noch keine eigenen Dokumente erstellt!

# introductionAction
source: Create digital identity
de: Digitale Identität erstellen

source: Back
de: Zurück

source: Next
de: Weiter

source: Submit
de: Erstellen

source: Skip
de: Überspringen

source: Yes
de: Ja

source: No
de: Nein

source: Items
de: Einträge

source: Item
de: Eintrag

source: All Files
de: Alle Dateien

# receivedDocs
source: Received Documents
de: Empfangene Dokumente

# ownDocs
source: Personal Documents
de: Eigene Dokumente

# manageDocs
source: Manage Documents
de: Dokumente verwalten

source: Share
de: Teilen

source: Sharing
de: Teilen

# sharemessage
source: Scan the resulting QR Code to retrieve the document.
de: Scanne den entstehenden QR-Code, um das Dokument abzurufen.

source: Delete
de: Löschen

# scanQR
source: Scan QR-Code
de: QR-Code scannen

# scanMessage
source: After a valid code is recognised, the document will be requested
de: Nachdem ein gültiger Code erkannt wurde, wird das Dokument angefordert

source: Delete Data
de: Daten löschen

# confirmDataDeletion
source: Are you sure to irrevocably delete all of your data?
de: Bist du sicher, dass du alle Daten unwiderruflich löschen willst?

source: Change Language
de: Sprache ändern

source: Created at:
de: Erstellt am:

source: Created
de: Erstellt

source: Identity
de: Identität

source: Settings
de: Einstellungen

source: Security
de: Sicherheit

source: Activate Touch ID
de: Touch ID aktivieren

source: Disable Touch ID
de: Touch ID deaktivieren

# touchIDText
source: Enable Touch ID to secure access to the App?
de: Touch ID aktivieren, um den Zugriff auf die App zu sichern?

# disableTouchIDText
source: Disable secure access to the App with Touch ID?
de: Sicheren Zugriff auf die App durch Touch ID deaktivieren?

source: Fingerprint
de: Fingerabdruck

source: Activate Fingerprint
de: Fingerabdruck aktivieren

source: Disable Fingerprint
de: Fingerabdruck deaktivieren

# fingerprintText
source: Enable Fingerprint to secure access to the App?
de: Fingerabdruck aktivieren, um den Zugriff auf die App zu sichern?

# disableFingerprintText
source: Disable secure access to the App with your fingerprint?
de: Sicheren Zugriff auf die App mit deinem Fingerabdruck deaktivieren?

source: Profile
de: Profil

source: Language
de: Sprache

source: Languages
de: Sprachen

source: Dark Mode
de: Dunkelmodus

# deleteAll
source: Delete all data
de: Alle Daten löschen

source: Update First Name
de: Vornamen aktualisieren

source: Update Last Name
de: Nachname aktualisieren

# updateEmail
source: Update Email Address
de: Email Adresse aktualisieren

source: Update Phone Number
de: Telefonnummer aktualisieren

source: Update Date of Birth
de: Geburtsdatum aktualisieren

# updateSex
source: Update Biological Sex
de: Geschlecht aktualisieren

source: Update Address
de: Adresse aktualisieren

source: Update City
de: Stadt aktualisieren

source: Update State
de: Bundesland aktualisieren

source: Update Postal Code
de: Postleitzahl aktualisieren

source: Update Country
de: Land aktualisieren

# updateErrorMessage
source: Aktualisierung deiner pers√∂nlichen Daten fehlgeschlagen
de: Aktualisierung fehlgeschlagen

# updateSuccessFirstName
source: First name has been updated
de: Dein Vorname wurde aktualisiert

# updateSuccessLastName
source: Last name has been updated
de: Dein Nachname wurde aktualisiert

# updateSuccessEmail
source: Email has been updated
de: Deine E-Mail wurde aktualisiert

# updateSuccessPhoneNumber
source: Phone number has been updated
de: Deine Telefonnummer wurde aktualisiert

# updateSuccessDateOfBirth
source: Date of Birth has been updated
de: Dein Geburtsdatum wurde aktualisiert

# updateSuccessSex
source: Biological sex has been updated
de: Dein Geschlecht wurde aktualisiert

# updateSuccessAddress
source: Address has been updated
de: Deine Adresse wurde aktualisiert

# updateSuccessCity
source: City has been updated
de: Deine Stadt wurde aktualisiert

# updateSuccessState
source: State has been updated
de: Dein Bundesland wurde aktualisiert

# updateSuccessPostalCode
source: Postal code has been updated
de: Deine Postleitzahl wurde aktualisiert

# updateSuccessCountry
source: Country has been updated
de: Dein Land wurde aktualisiert

# missingInput
source: The field must not be empty.
de: Das Feld darf nicht lehr sein.

# missingFirstName
source: Please input your first Name.
de: Bitte gib deinen Vornamen ein.

# missingLastName
source: Please input your last name.
de: Bitte gib deinen Nachname ein.

# missingEmail
source: Please input your email.
de: Bitte gib deine E-Mail ein.

# invalidEmail
source: Not a valid Email.
de: Dies ist keine gültige E-Mail.

# missingPhoneNumber
source: Please input your phone Number.
de: Bitte gib deine Telefonnummer ein.

# missingCity
source: Please input your city.
de: Bitte gib deine Stadt ein.

# missingState
source: Please input your state.
de: Bitte gib dein Bundesland ein.

# missingPostalCode
source: Please input your postal code.
de: Bitte gib deine Postleitzahl ein.

# missingCountry
source: Please input your country.
de: Bitte gib dein Land ein.
